// src/components/SchoolInfoCard.tsx
"use client";
import { Noto_Sans_Bengali } from "next/font/google";
import React from "react";

const bengeli = Noto_Sans_Bengali({
  weight: '400'
 
});

const SchoolInfoCard = () => {
  return (
    <div className={` ${bengeli.className}  bg-white rounded-2xl shadow-lg p-6 h-135 w-full flex flex-col`}>
      {/* Centered Title */}
      <h2 className="text-3xl sm:text-xl lg:text-2xl md:text-2xl font-bold text-blue-900 mb-4 text-center">
  🏫 Kumulli Bachchu Mia Model High School

</h2>


      {/* Scrollable text */}
      <div className={`overflow-y-auto h-115 pr-3 text-justify text-gray-700 dark:text-gray-300 leading-relaxed`}
           style={{
             whiteSpace: "pre-wrap",
             wordBreak: "keep-all",
             overflowWrap: "anywhere",
           }}>
        <p>
         
          দার্শনিক ও শিক্ষাবিদ শিক্ষাকে বিভিন্নভাবে সংজ্ঞায়িত করেছেন। শিক্ষার উদ্দেশ্যে বর্ণনা করে গেছেন। 
          প্রাচীন দার্শনিক এরিস্টোটল, সক্রেটিস ও প্লেটো শিক্ষার তাৎপর্য বর্ণনা করে গেছেন। 
          সেই থেকে পরবর্তী সকল যুগের চিন্তাবিদরাই শিক্ষা সম্পর্কে কথা বলেছেন। 
          শিক্ষার পরিচয় এবং সংজ্ঞা দেবার চেষ্টা করেছেন। আল কুরআন থেকে জানা যায়, 
          নবীগণ শিক্ষা প্রচারের উদ্দেশ্যেরই প্রেরিত হয়েছিলেন। তাঁরা শিক্ষার তাৎপর্য এবং লক্ষ্য উদ্দেশ্য 
          সুস্পষ্টভাবে নিজ নিজ জাতির সামনে পেশ করেছেন। সর্বশেষ নবী হযরত মুহাম্মাদ সাল্লাল্লাহু 
          আলাইহি ওয়াসাল্লামও শিক্ষক হিসেবেই প্রেরিত হয়েছিলেন。 
          <br/>
          মানুষ কেবল চোখ দিয়েই দেখেনা, এর পেছনে রয়েছে তার সক্রিয় মন ও মগজ। রয়েছে তার একটা দৃষ্টিভংগি ও মতামত। 
          জীবনের একটা উদ্দেশ্য ও লক্ষ্য আছে তার। সমস্যাবলী নিয়ে চিন্তা ভাবনা করার একটা প্রক্রিয়া তার আছে। 
          মানুষ যা কিছু দেখে, শুনে এবং জানে, সেটাকে সে নিজের অভ্যন্তরীণ মৌলিক চিন্তা ও ধ্যান ধারণার সাথে 
          সামঞ্জস্যশীল করে নেয়। অতপর সেই চিন্তা ও ধ্যান ধারণার ভিত্তিতেই তার জীবন পদ্ধতি গড়ে উঠে। 
          এই জীবন পদ্ধতিই হলো সংস্কৃতি। যে জাতি একটা স্বতন্ত্র সংস্কৃতি, আকিদা বিশ্বাস ও উদ্দেশ্য লক্ষ্যর অধিকারী 
          এবং যাদের রয়েছে নিজস্ব জীবনাদর্শ, তাদেরকে অবশ্যই তাদের নতুন প্রজন্মকে সেই স্বতন্ত্র সংস্কৃতি, 
          আকিদা বিশ্বাস, উদ্দেশ্য, লক্ষ্য ও জীবনাদর্শের রক্ষণাবেক্ষণ এবং তার বিকাশ ও উন্নয়নের যোগ্য করে 
          গড়ে তোলা কর্তব্য। আর সে উদ্দেশ্যকে কেন্দ্র করেই গড়ে তুলতে হবে তাদের শিক্ষা ব্যবস্থা।
        </p>
      </div>
    </div>
  );
};

export default SchoolInfoCard;